class Messages:

    MENU_MAIN = {
        "title": "\nГлавное меню:",
        "choose_task": "1 — Задание №2",
        "disable_log": "2 — Отключить логирование (CRITICAL)",
        "exit": "0 — Выход",
        "prompt": "> "
    }

    MENU_TASK8 = {
        "title": "\n--- Меню задания №2 ---",
        "manual": "1. Ввести массивы вручную",
        "generate": "2. Сгенерировать массивы",
        "analyze": "3. Выполнить анализ",
        "result": "4. Показать результат",
        "back": "0. Назад",
        "prompt": "Ваш выбор: "
    }

    ERRORS = {
        "not_number": "Ошибка: вводите только числа!",
        "no_result": "Ошибка: анализ ещё не выполнен",
        "unknown": "Произошла неизвестная ошибка!"
    }

    ACTIONS = {
        "analysis_done": "Анализ выполнен",
        "logs_off": "Логирование отключено"
    }
